{
  "users": [
    {
      "email": "ninhxz147@gmail.com",
      "password": "$2a$10$ioBPJ83n9OSHLi2K5ks/huGYaaLufYiEyl0Rapoo5Cs4qfD8CnP5a",
      "phone": "0363480678",
      "id": 1,
      "role": 1
    },
    {
      "email": "ninhple147@gmail.com",
      "password": "$2a$10$NK10PzLc1WktiU05.I7yA.NANUlYv3GEH6rOgYrHAi5dGgG1W17DO",
      "phone": "0363480678",
      "id": 2
    },
    {
      "email": "ninh147@gmail.com",
      "password": "$2a$10$NIQx/3uLzKEqL5ApCewIIOjxLdakj2diZGa/wC0XR4i0SzVtU3ake",
      "phone": "0363480678",
      "id": 3
    },
    {
      "email": "newacc147@gmail.com",
      "password": "$2a$10$K78nZxnCuPjWwOf0KjOx.eJDUsFzuX88hEz/X09T/k7zl4qoJ1/lu",
      "phone": "0363480678",
      "id": 4
    }
  ],
  "products": [
    {
      "id": 1,
      "image": "https://cdn2.cellphones.com.vn/358x/media/catalog/product/i/p/iphone_11_white_4_.png",
      "name": "iPhone 11 64GB 312312",
      "price": "18000000",
      "sale": "10790000",
      "longDesc": "    Điện thoại iPhone 11 tuy sở hữu mức giá phải chăng nhưng lại được trang bị cấu hình khủng, camera ấn tượng đi kèm những tính năng hiện đại. Sau đây hãy cùng CellphoneS đánh giá chi tiết sản phẩm trước khi đưa ra quyết định có nên mua hay không nhé!",
      "shortDesc": "Apple luôn làm hài lòng tín đồ iFan với các dòng iPhone trong từng phân khúc giá. Đặc biệt, phiên bản iPhone 11 vừa ra mắt nhưng đã chiếm lĩnh được thị trường smartphone trên toàn thế giới với giá cả phải chăng. Cùng tìm hiểu chi tiết rõ hơn qua bài viết sau đây để có quyết định có nên mua hay không nhé!",
      "salientfeatures": "    Màu sắc phù hợp cá tính - 6 màu sắc bắt mắt để lựa chọn Hiệu năng mượt mà, ổn định - Chip A13, RAM 4GB Bắt trọn khung hình - Camera kép hỗ trợ góc rộng, chế độ Night Mode Yên tâm sử dụng - Kháng nước, kháng bụi IP68, kính cường lực Gorilla",
      "category": "1",
      "isDelete": false
    },
    {
      "id": 2,
      "image": "https://cdn2.cellphones.com.vn/358x/media/catalog/product/1/_/1_69_35.jpg",
      "name": "Laptop Asus Gaming Rog Strix G15 G513IH HN015W",
      "price": "23990000",
      "sale": "17990000",
      "longDesc": " Điện thoại iPhone 11 tuy sở hữu mức giá phải chăng nhưng lại được trang bị cấu hình khủng, camera ấn tượng đi kèm những tính năng hiện đại. Sau đây hãy cùng CellphoneS đánh giá chi tiết sản phẩm trước khi đưa ra quyết định có nên mua hay không nhé!",
      "shortDesc": "hahahaha",
      "salientfeatures": " Màu sắc phù hợp cá tính - 6 màu sắc bắt mắt để lựa chọn Hiệu năng mượt mà, ổn định - Chip A13, RAM 4GB Bắt trọn khung hình - Camera kép hỗ trợ góc rộng, chế độ Night Mode Yên tâm sử dụng - Kháng nước, kháng bụi IP68, kính cường lực Gorilla",
      "category": "3",
      "isDelete": false
    },
    {
      "id": 3,
      "image": "https://cdn2.cellphones.com.vn/358x/media/catalog/product/s/a/samsung-galaxy-tab-s7-fe-chinh-hang_1.jpg",
      "name": "Samsung Galaxy Tab S7 FE (4G)",
      "price": "13990000",
      "sale": "11190000",
      "shortDesc": "Apple luôn làm hài lòng tín đồ iFan với các dòng iPhone trong từng phân khúc giá. Đặc biệt, phiên bản iPhone 11 vừa ra mắt nhưng đã chiếm lĩnh được thị trường smartphone trên toàn thế giới với giá cả phải chăng. Cùng tìm hiểu chi tiết rõ hơn qua bài viết sau đây để có quyết định có nên mua hay không nhé!",
      "salientfeatures": "Màu sắc phù hợp cá tính - 6 màu sắc bắt mắt để lựa chọn Hiệu năng mượt mà, ổn định - Chip A13, RAM 4GB Bắt trọn khung hình - Camera kép hỗ trợ góc rộng, chế độ Night Mode Yên tâm sử dụng - Kháng nước, kháng bụi IP68, kính cường lực Gorilla",
      "isDelete": false,
      "category": 2
    },
    {
      "id": 4,
      "image": "http://res.cloudinary.com/thisisninh/image/upload/v1658459845/1_69_23_n5zyfy.jpg",
      "name": "Laptop Gaming Acer Nitro 5 AN515 45 R6EV",
      "price": "23990000",
      "sale": "18990000",
      "longDesc": "Thiết kế gaming bắt mắt, đèn nền nhiều màu sắc\nLaptop Gaming Acer Nitro 5 AN515-45-R6EV sở hữu kiểu dáng vô cùng thu hút với mặt lưng nổi bật, hầm hố. Khung viền hoàn thiệt chắc chắn từ nguyên liệu chất lượng cao, dày 23.9mm hầm hố nhưng không quá nặng nề.\n\nBàn phím trên laptop được thiết kế fullsize với đèn nền chuyển màu. Bàn phím có độ nảy êm ái, có đèn ánh sáng rất dễ dùng không cần lo điều kiện ánh sáng có tốt không.\n\nThiết kế gaming đẹp bất chấp\n\nHiệu năng mạnh mẽ, đáp ứng mọi nhu cầu sử dụng\nLaptop Gaming Acer Nitro 5 AN515-45-R6EV được trang bị bộ vi xử lý AMD Ryzen 5 dòng H manh mẽ, con chip có sức mạnh tối đa đến 4.2GHz. Bộ nhớ đệm 16GB sẵn sàng hỗ trợ mọi thao tác lưu tệp dữ liệu trong văn phòng từ cơ bản đến nâng cao.\n\nBộ RAM 8GB mang lại cho Acer Nitro 5 AN515-45-R6EV khả năng đa nhiệm mượt mà. Giúp mọi công việc đều trơn tru và hiệu quả.",
      "shortDesc": "Nổi tiếng là một thiết kế phá cách diện mạo cùng hiệu năng mạnh mẽ ấn tượng, chiếc laptop này có ấn tượng mạnh từ ngoài vào trong. Bạn có thể thực hiện mọi thao tác hằng ngày mượt mà trên laptop Gaming Acer Nitro 5 AN515-45-R6EV. Hãy xem những ưu điểm cuốn hút khiến người dùng bất chấp tất cả để lựa chọn nó nhé!",
      "salientfeatures": "Thiết kế gaming bắt mắt, đèn nền nhiều màu sắc\nHiệu năng mạnh mẽ, đáp ứng mọi nhu cầu sử dụng - Ryzen 5 5600H\nRAM 8GB cho đa nhiệm mượt mà, xử lí hiệu quả công việc\nĐa dạng cổng kết nối - Type-C, USB 3.0, HDMI, 3.5 mm",
      "isDelete": false,
      "category": "3"
    },
    {
      "id": 5,
      "image": "http://res.cloudinary.com/thisisninh/image/upload/v1658460158/2_39_y75q2g.webp",
      "name": "iPad Air 5 (2022) 64GB I Chính hãng Apple Việt Nam",
      "price": "16990000",
      "sale": "15590000",
      "longDesc": "So với thế hệ iPad Air 4 hồi năm 2020 thì chiếc iPad Air 2022 được mong đợi sẽ có nhiều cải tiến, trong đó nổi bật là màn hình, vi xử lý, dung lượng pin, bộ nhớ trong. Dưới đây là bảng so sánh thông số kỹ thuật dự kiến của iPad Air 2020 và 2022 bạn có thể tham khảo:\n\niPad Air 5\n\niPad Air 4\n\nMàn hình\n\nIPS Led-backlit Multi-Touch 10.9 inch\n\nIPS LCD 10.9 inch\n\nChip xử lý\n\nApple M1\n\nA14 Bionic\n\nDung lượng RAM\n\n8GB\n\n4GB\n\nBộ nhớ trong\n\n64GB (bản tiêu chuẩn)\n\n64GB (bản tiêu chuẩn)\n\nThời lượng pin\n\n10 giờ\n\n10 giờ\n\nHỗ trợ 5G\n\nCó\n\nCó\n\nCamera\n\n12MP\n\n12MP\n\niPad Air 5 khi nào ra mắt?\nTheo các tin đồn trong thời gian qua thì dự kiến máy tính bảng iPad Air 2022 dự kiến sẽ được Apple ra mắt vào ngày 8 tháng 3 sắp tới đây. Mặc dù rất khó để có sự thay đổi lớn tuy nhiên chúng ta có thể mong đợi chiếc iPad mới sẽ được cải tiến nhiều hơn và giá bán cũng sẽ hấp dẫn hơn.\n\niPad Air 5\n\nTrong sự kiện này, Apple được cho là có thể trình làng dòng Macbook Air hoặc Macbook Pro mới với chip M2 mạnh mẽ. Cùng không loại trừ khả năng, \"Táo khuyết\" cũng sẽ giới thiệu chiếc iPad Pro thế hệ mới.\n\niPad Air 5 giá bao nhiêu?\nCho đến thời điểm hiện tại chúng ta vẫn chưa có thông tin chính thức về giá bán của sản phẩm. Tuy nhiên theo nguồn tin rò rỉ mới đây cho hay, Apple sẽ không tăng giá của iPad Air 5 lên quá nhiều so với thế hệ tiền nhiệm trước đó mà vẫn sẽ giữ cho sản phẩm của mình vẫn trong tầm giá này.\n\niPad Air 5\n\nNhiều khả năng, giá bán của iPad Air M1 năm 2022 phiên bản 64GB dự kiến sẽ có mức giá khởi điểm từ 599 USD, trong khi đó phiên bản 256GB bộ nhớ trong sẽ có giá bán từ 749 USD. Phiên bản có hỗ trợ mạng 5G sẽ có mức giá cao hơn 150 USD.\n\nĐánh giá iPad Air 2022 dựa vào các tin đồn rò rỉ\nDựa vào các nguồn thông tin rò rỉ xuất hiện trên khắp các trang mạng trong thời gian gần đây, chúng ta cũng đã có được cái nhìn tổng quan về dòng iPad Air 5 sắp ra mắt trong năm 2022.\n\nThiết kế tinh tế, màn hình Liquid Retina 10.9 inch\niPad Air 5 2022 với thiết kế màn hình cảm ứng đa điểm có đèn nền LED kích thước 10.9 inch IPS.  Độ phân giải 2360x1640, màn hình màu rộng cùng công nghệ màn hình True Tone cho hình ảnh chân thực, mượt mà, sống động và sắc nét. \n\niPad Air 5\n\nBên cạnh đó, lớp phủ chống phản xạ, lớp phủ oleophobic chống bám vân tay giúp nâng cao trải nghiệm người dùng. Hiển nhiên tần số quét giúp người dùng có thể dễ dàng quan sát được các chuyển động hình ảnh mượt mà. Nhờ đó, những thước phim hành động và tựa game được thể hiện một cách tuyệt vời. iPad Air vẫn hỗ trợ Apple Pencil 2, Touch ID ở nút nguồn, Smart Keyboard Folio hoặc bàn phím Magic Keyboard.\n\nHiệu năng ấn tượng: Apple M1, 8GB RAM\nĐáp ứng với nhu cầu về hiệu năng, chiếc iPad Air 2022 cũng nối gót với iPhone 13 sắp ra mắt và sử dụng con chip mới là Apple M1 mang đến hiệu năng xử lý vượt trội, nhanh chóng hơn và đảm bảo nhờ 8GB RAM mang đến sức mạnh không hề thua kém với một chiếc PC.\n\nDĩ nhiên là bạn có thể làm mọi điều với nó, như chơi game hiệu năng, chỉnh sửa ảnh. Bên cạnh đó, chiếc iPad Air 5 sẽ hỗ trợ kết nối với bàn phím Magic Keyboard để biến máy thành một chiếc laptop ấn tượng.\n\niPad Air 5\n\nChiếc iPad Air M1 sẽ được tích hợp sẵn iPadOS 15 sau khi được xuất xưởng. Tính năng tuyệt vời của hệ điều hành này nằm ở việc ghi chú lại thông qua Quick Note, sử dụng SharePlay để kết nối với bạn bè, gia đình hoặc thực hiện gọi, tra cứu chỉ đường hoặc gửi mail qua Live Text chỉ bằng mọt thao tác chạm.\n\nTừ các ứng dụng của App Store, iPad Air có thể biến tấu trở thành lớp học hoặc nơi sáng tạo. Bên cạnh đó, các ứng dụng đi kèm như Swift Playgrounds hỗ trợ xây dựng và gửi ứng dụng lên App Store ngay trên thiết bị.\n\nCamera sắc nét 12MP, tính năng Smart HDR nổi bật\nTuy không phải điểm mạnh của sản phẩm này bởi người dùng sử dụng để chụp ảnh là rất ít, nên Apple cũng không quá chú trọng. Tuy nhiên, iPad Air 5 vẫn đáp ứng được khả năng bắt hình ảnh sắc nét. Với camera chính 12MP và tính năng Smart HDR hỗ trợ cho ra những bức ảnh sống động và cả quay phim chất lượng 4K tuyệt vời.\n\niPad Air 5\n\nPhía trước của iPad Air 5 là một camera selfie với độ phân giải 12 MP Ultra Wide hỗ trợ quay phim 1080p, video call chất lượng cao. Dĩ nhiên bạn có thể sử dụng nó như một chiếc máy ảnh quay phim về vlog để chia sẻ cho bạn bè và người thân.\n\nDung lượng cao, sử dụng thời gian dài\niPad Air 5 tích hợp pin lithium – polymer có thể sạc lại 28.6 W/ giờ. Sạc pin thông qua USB Type C hoặc bộ đổi nguồn vào hệ thống máy tính.\n\nThời lượng pin có thể lên đến 10 giờ lướt web hoặc xem video qua wifi hoặc 9 giờ nếu sử dụng bằng mạng dữ liệu di động. Người dùng càng yên tâm hơn khi sử dụng thiết bị suốt cả ngày dài mà không lo hết pin.\n\niPad Air 5",
      "shortDesc": "Mỗi khi một chiếc iPad mới vừa ra lò như một cơn chấn động thật sự bùng nổ. Đến năm 2022, chúng ta lại tiếp tục bùng nổ với chiếc iPad mới mang tên iPad Air 5 với nhiều cải tiến đáng giá. Thế hệ thứ 5 này mang đến cho bạn những điểm gì vượt trội hay có gì sáng giá để sở hữu, hãy để lại phần bình luận ở bên dưới nhé.",
      "salientfeatures": "Mỗi khi một chiếc iPad mới vừa ra lò như một cơn chấn động thật sự bùng nổ. Đến năm 2022, chúng ta lại tiếp tục bùng nổ với chiếc iPad mới mang tên iPad Air 5 với nhiều cải tiến đáng giá. Thế hệ thứ 5 này mang đến cho bạn những điểm gì vượt trội hay có gì sáng giá để sở hữu, hãy để lại phần bình luận ở bên dưới nhé.",
      "isDelete": false,
      "category": "2"
    },
    {
      "id": 6,
      "image": "https://cdn2.cellphones.com.vn/358x/media/catalog/product/l/o/loa-jbl-charge-5-xanh-nhat-teal-4_2_1.jpg",
      "name": "Loa bluetooth JBL Charge 5",
      "price": "3990000",
      "sale": "20000",
      "longDesc": "  Loa tốt",
      "shortDesc": "Loa JBL",
      "salientfeatures": "  Nghe 20H\nKết nối 2 ica\nCông suất 40W",
      "isDelete": false,
      "category": "4"
    },
    {
      "image": "http://res.cloudinary.com/thisisninh/image/upload/v1658426351/sm-s901_galaxys22_front_phantomwhite_211122_2_ykzaf5.webp",
      "name": "Samsung Galaxy S22 (8GB - 128GB)",
      "price": "21990000",
      "sale": "16090000",
      "longDesc": "Nếu như bạn muốn sở hữu ngay cho mình chiếc Samsung Galaxy S22 ấn tượng này thì hãy nhanh chóng đến với CellphoneS để đặt hàng và trở thành một trong những người đầu tiên sở hữu. Giá thành phải chăng cùng nhiều ưu đãi hấp dẫn dành cho bạn. Vậy còn chần chừ gì nữa mà không đến với CellphoneS và sở hữu ngay cho mình chiếc smartphone đẳng cấp thời thượng mới nhất đến từ nhà Samsung này. ",
      "shortDesc": "Đây được xem là một trong những cái tên đáng được mong chờ nhất trong năm 2021. Sở hữu thiết kế đẹp mắt cùng hiệu năng mạnh mẽ, điện thoại Samsung S22 hứa hẹn đây sẽ là chiếc smartphone làm mưa làm gió trên thị trường ngay từ khi được ra mắt. Đây sẽ là sự lựa chọn không thể nào thích hợp hơn dành cho bạn.",
      "salientfeatures": "Điện thoại Samsung Galaxy S22 sở hữu thiết kế nguyên khối cứng cáp và bền bỉ tuy nhiên mỏng hơn người đàn anh tiền nghiệm của mình là Galaxy S21. Tuy nhiên các đường nét thiết kế được thừa hưởng vẫn không khác nhau là mấy. Các chi tiết được hoàn thiện tỉ mỉ chính xác và trau chuốt từng góc cạnh mang lại một tổng thể sang trọng bắt mắt và tinh tế.\n\nMặt lưng có thiết kế bóng bẩy dễ dàng thu hút người dùng ngay từ cái nhìn đầu tiên nhìn vào Samsung S22 phiên bản tiêu chuẩn này.",
      "isDelete": false,
      "category": "1",
      "id": 7
    },
    {
      "image": "http://res.cloudinary.com/thisisninh/image/upload/v1658459677/mwp22_av2_2_gepduh.webp",
      "name": "Tai nghe Bluetooth Apple AirPods Pro 2021 Magsafe | Chính hãng Apple Việt Nam",
      "price": "6990000",
      "sale": "4790000",
      "longDesc": "AirPods Pro 2021 được Apple tái thiết kế nhằm mang đến trải nghiệm nghe nhạc êm ái, không gây đau tai cho bạn. Mỗi bên củ tai AirPods Pro 2021 có thiết kế nhét trong, với ba kích thước đệm tai silicone khác nhau cho bạn tự chọn kích thước vừa nhất. Phần đệm tai cũng được Apple thiết kế để ngăn tạp âm lọt vào trong, cho bạn một trải nghiệm nghe nhạc trọn vẹn.\n\nAirPods Pro Magsafe còn đạt chuẩn chống nước và chống thấm mồ hôi cho các hoạt động tập luyện cường độ nặng. Tai nghe còn tích hợp cổng microphone mở rộng giúp tăng cường chất lượng nghe gọi trong môi trường có gió mạnh.\n\nThi&ecirc;́t k&ecirc;́ cải ti&ecirc;́n tăng đ&ocirc;̣ &ecirc;m nhẹ khi đeo\n\nAirPods Pro 2021 được chế tạo với kiểu dáng nhỏ gọn cùng với trọng lượng nhẹ, giúp bạn luôn thoải mái khi đeo trên tai. Phần thân được tích hợp vùng cảm biến chạm giúp bạn dễ dàng điều chỉnh âm nhạc, nhận cuộc gọi, và chuyển đổi giữa các tính năng hỗ trợ.\n\nAirPods Pro 2021 còn được thiết kế để tương thích tối đa với iPhone. Ngay khi mở nắp hộp đựng, cả AirPods Pro 2021 và iPhone sẽ tự động kết nối với nhau. Và bạn hoàn toàn có thể ra lệnh cho Siri để thực hiện thao tác tiện lợi với tai nghe.\n\nÂm thanh đẳng cấp, cách âm ưu việt\nAirPods Pro 2021 mang đến chất lượng âm thanh đặc sắc và đẳng cấp. Bên trong tai nghe cũng trang bị các phần cứng giúp tăng cường độ mạnh âm bass, cân bằng các dải âm thấp và trung, cũng như lọc tiếng ồn khi thu âm giọng nói cho chất lượng cuộc gọi tốt hơn.\n\n&Acirc;m thanh đẳng c&acirc;́p, cách &acirc;m ưu vi&ecirc;̣t\n\nMột trong những điểm nổi bật nhất trên AirPods Pro 2021 không thể bỏ qua tính năng chống ồn chủ động (ANC). Hệ thống chống ồn được điều chỉnh liên tục 200 lần / giây để cho việc nghe nhạc trên AirPods Pro 2021 trở nên hấp dẫn không ngừng.\n\nSạc pin tiện lợi qua cổng USB-C, dùng không ngừng nghỉ\nTai nghe AirPods Pro 2021 Magsafe được lưu giữ trong hộp đựng màu trắng sang trọng - và cũng là hộp sạc không dây MagSafe. Hộp sạc được Apple chế tạo giúp tương thích với không chỉ sạc MagSafe, mà còn với nhiều loại đế sạc không dây khác. Và mỗi khi AirPods Pro 2021 đạt trạng thái pin thấp, tai nghe sẽ tự động gửi thông báo đến iPhone cho việc sạc pin kịp thời.\n\nSạc pin ti&ecirc;̣n lợi qua cổng USB-C, dùng kh&ocirc;ng ngừng nghỉ\n\nMỗi củ tai AirPods Pro 2021 khi sạc đầy sẽ cung cấp đến 4.5 giờ nghe nhạc liên tục. Và chỉ 5 phút đặt vào hộp sạc, AirPods Pro 2021 sẽ có khả năng phát nhạc khoảng 1 giờ thỏa thích.  ",
      "shortDesc": "Sở hữu thiết kế đeo tai siêu êm nhẹ cùng âm thanh chất lượng đầy mê hoặc, tai nghe Apple AirPods Pro 2021 Magsafe được hãng Apple chế tạo nhằm mang đến những trải nghiệm nghe nhạc khó quên.",
      "salientfeatures": "Hỗ trợ tính năng chống ồn chủ động ANC\nTính năng xuyên âm giúp người dùng nghe được âm thanh của môi trường xung quanh\nThời gian sử dụng 4.5 giờ khi bật chế độ chống ồn,19 giờ khi đi kèm với hộp sạc\nTrang bị cổng sạc Lightning,5 phút sạc cho 1 giờ sử dụng\nKích hoạt trợ lý ảo Siri bằng cách gọi \"\"Hey Siri\"\"\nChống nước chuẩn IPX4 cho phép thoải mái luyện tập mà không lo thấm mồ hôi\nCó khả năng định vị tai nghe bị thất lạc",
      "isDelete": false,
      "category": "4",
      "id": 8
    },
    {
      "image": "http://res.cloudinary.com/thisisninh/image/upload/v1658476076/sm-s908_galaxys22ultra_front_green_211119_pihljx.webp",
      "name": "Samsung Galaxy S22 Ultra (8GB - 128GB)",
      "price": "30990000",
      "sale": "24490000",
      "longDesc": "Trước khi chính thức ra mắt cộng đồng những chiếc điện thoại Samsung S22 Series đã có thời gian được thai nghén khá dài để đảm bảo có những tính năng thực sự vượt trội so với phiên bản tiền nhiệm. Để có thể hình dung rõ ràng ta xét đến 2 mẫu Samsung S22 Ultra và S21 Ulta xem dòng flagship mới nhà Samsung có những nâng cấp nổi trội nào nhé!\n\nGalaxy S22 Ultra\tGalaxy S21 Ultra\nMàu sắc\n\nĐỏ Burgundy\n\nĐen Phantom\n\nXanh Zeta\n\nTrắng Phantom\n\nBạc Phantom\n\nĐen Phantom\n\nKích thước\n\n6.8 inch\n\n6.8 inch\n\nMàn hình\n\nDynamic AMOLED 2X\n\nDynamic AMOLED 2X\n\nĐộ phân giải\n\n2K+ (1440 x 3088 Pixels)\n\n2K+ (1440 x 3200 Pixels)\n\nCPU\n\nSnapdragon 8 Gen 1\n\nExynos 2100 8 nhân\n\nROM - Bộ nhớ trong\n\n128GB/256GB\n\n128GB/256GB/512GB\n\nRAM - Bộ nhớ đệm\n\n12GB\n\n12GB\n\nCamera trước\n\n40MP\n\n40 MP\n\nCamera sau\n\nChính: 108 MP\n\nGóc siêu rộng: 12MP\n\nTele: 10MP\n\nTele: 10MP\n\nZoom quang học: 3x, 10x\n\nChính: 108 MP\n\nGóc siêu rộng: 12MP\n\nTele: 10MP\n\nTele: 10MP\n\nZoom quang học: 10x\n\nDung lượng Pin\n\n5000 mAh\n\n5000 mAh\n\nKhả năng sạc nhanh\n\n45W\n\n25W\n\nĐánh giá Samsung Galaxy S22 Ultra 5G chi tiết\nNhững nâng cấp lớn về hiệu năng, dung lượng pin, và trên hết là camera sau chính là những điểm khiến nó trở thành siêu phẩm trong phân khúc cao cấp. Dưới đây là những thông tin cần biết về dòng điện thoại vừa ra mắt của Samsung. Dưới đây là thông số cấu hình của Samsung S22 Ultra vừa được gã khổng lồ Hàn Quốc giới thiệu.\n\nThiết kế nguyên khối - kính sang trọng với độ bền tối ưu\nSamsung Galaxy S22 Ultra đi theo ngôn ngữ thiết kế nguyên khối - kính cao cấp và sang trọng, vốn đã làm nên sự thành công của model tiền nhiệm. Chiếc máy có thiết kế mặt lưng đơn sắc tối giản nhưng không kém phần tinh tế, và màn hình tràn viền bao phủ gần như trọn mặt trước, tạo nên trải nghiệm quan sát rộng rãi trên một thiết bị di động nhỏ gọn vừa tay cầm.\n\nĐộ bền của máy được đảm bảo tối ưu không chỉ qua lớp vỏ nhôm nguyên khối Amor đánh bóng, mà còn qua kính cường lực Corning Gorilla Glass Victus+ bao phủ hai mặt trước và sau. Khung nhôm và kính hoạt động như bộ giáp bảo vệ điện thoại an toàn. Chiếc máy còn có khả năng chống bụi / nước đạt chuẩn IP68 giúp người dùng luôn an tâm khi dùng máy trong những điều kiện môi trường khác nhau.\n\nSamsung S22 Ultra 5G c&oacute; thi&ecirc;́t k&ecirc;́ sang trọng với đ&ocirc;̣ b&ecirc;̀n t&ocirc;́i ưu\n\nỐng kính 108MP mang lại khả năng chụp ảnh không giới hạn\nỐng kính chính trên Samsung S22 Ultra với độ phân giải lên đến 108MP, với những khả năng chụp ảnh đêm, chụp chân dung, chụp góc siêu rộng, và zoom quang học 100x đều hiện diện. Chi tiết ảnh và màu sắc tốt nằm trong khoảng zoom 10x, có thể sử dụng zoom 30x trong điều kiện ánh sáng tốt, còn zoom 100x mang tính chất lưu lại thông tin. Camera chính và camera tele hỗ trợ công nghệ chống rung quang học OIS.\n\nCụm camera sau cho phép người dùng sáng tạo ảnh chụp của mình không giới hạn. Hai ống kính còn lại là ống kính 12MP hỗ trợ chụp góc siêu rộng và ống kính tele 10MP. Người dùng có thể sử dụng S22 chụp ảnh macro với ống kính siêu rộng. Màu sắc và chi tiết ảnh cao hơn các model tầm trung, cho độ phân giải và cảm biến tốt hơn.\n\nCamera 108MP tr&ecirc;n S22 Ultra mang lại khả năng chụp ảnh kh&ocirc;ng giới hạn\n\nThiết bị được trang bị khả năng chụp ảnh chân dung ban đêm, trong điều kiện thiếu sáng ấn tượng với bộ xử lý hình ảnh AI kết hợp với camera góc rộng 108MP mang lại bức ảnh ban đêm sáng rõ. Với không gian không quá tối, chỉ với thao tác sử dụng chế độ tự động, AI sẽ tự xử lý cho ra hình ảnh sáng, đầy đủ chi tiết và không bị nhiễu. Trường hợp thiếu sáng, chế độ chụp đêm là sự lựa chọn hoàn hảo.\n\nTốc độ khung hình phát hiện ánh sáng và tự động chuyển sang tốc độ khung hình tối ưu. Samsung Galaxy S22 Ultra sử dụng bộ xử lý 4nm với công nghệ Super Night Solution giảm nhiễu hiệu quả.\n\nĐồng thời, người dùng có thể điều chỉnh được mức độ xóa phông sau khi chụp. Khi thực hiện quay video cần hiệu chỉnh phần hậu cảnh, người dùng có thể làm nổi bật chủ thể bằng cách sử dụng bộ lọc đổi phông thành đen trắng. Phần chuyển nét mượt mà và không có cảm giác bị lẹm.\n\nĐ&aacute;nh gi&aacute; camera Samsung Galaxy S22 Ultra 5G\n\nKhông chỉ chụp ảnh, thiết bị còn mang lại khả năng quay phim chất lượng với khả năng chống rung và công nghệ AI mang lại những thước phim chuyển động nhanh mà vẫn đảm bảo rõ nét, zoom tốt hơn. Điện thoại còng được trang bị công nghệ Super HDR tốt với tất cả các ống kính mang lại những thước phim giàu chi tiết. Ấn tượng nhất trên camera của Samsung S22 Ultra đó chính là khả năng thu phóng 100 lần đầy ấn tượng.\n\nPhía trước máy là camera selfie đơn với độ phân giải lên đến 40 MP, khẩu độ f/2.2 với khả năng chụp góc rộng cho ra ảnh chụp selfie bắt mắt. Tính năng làm đẹp AI, gọi video call kép và HDR tự động sẽ giúp tăng cường trải nghiệm chụp ảnh trên chiếc flagship này.\n\nĐiểm nổi bật nữa của cụm camera nằm ở thời gian phơi sáng đến 6 giây nhưng bị rung nhòe kể cả không sử dụng chân đế!\n\nĐ&aacute;nh gi&aacute; camera Samsung Galaxy S22 Ultra 5G - Ảnh 2\n\nMàn hình 6.8 inch 120 Hz tương thích bút S-Pen hiện đại\nVới Galaxy S22 Ultra thì Samsung đã cho ra đời loại màn hình phủ trọn mặt trước đầy ấn tượng. Chiếc màn hình điện thoại có kích thước 6.8 inch, độ phân giải Quad HD+ (3200 x 1440 pixels) và sử dụng tấm nền Dynamic AMOLED 2X với Vision Booster cho ra độ bão hòa màu sắc đầy chân thực.\n\nMàn hình của Samsung S22 Ultra còn được tích hợp những tính năng cao cấp đặc trưng của Samsung như Always on display, tốc độ làm tươi đến 120 Hz cho trải nghiệm gaming vượt trội và chứng nhận màu HDR10+. Bề mặt màn hình được bảo vệ bởi kính Gorilla Glass Victus chống xước hiệu quả.\n\nSamsung S22 Ultra c&oacute; màn hình 6.8 inch 120 Hz tương thích bút S-Pen hi&ecirc;̣n đại\n\nVi xử lý Snapdragon 8 Gen 1 cùng pin lớn giúp giải trí hiệu quả\nVới Samsung S22 Ultra 5G, nhà sản xuất đã chế tạo nên bộ vi xử lý thế hệ mới mang tên Qualcomm Snapdragon 8 Gen 1. Hiệu năng trên Qualcomm Snapdragon 8 Gen 1 được cải tiến rất nhiều so với thế hệ trước nhằm mang lại hiệu năng mượt mà đáp ứng cả những tựa game nặng nhất, đồng thời chứa khả năng tiết kiệm năng lượng pin giúp người dùng yên tâm dùng máy dài lâu.\n\nCon chip Qualcomm Snapdragon 8 Gen 1 được sản xuất trên tiến trình 4nm không chỉ mang lại một hiệu năng mạnh mẽ mà còn sở hữu sức mạnh AI mang lại trải nghiệm chụp đêm vượt trội.\n\nNói về pin, điện thoại được trang bị viên pin dung lượng 5000mAh sẽ cung cấp cho người dùng tới 81 giờ chơi nhạc. Công nghệ sạc nhanh siêu tốc 45W, cùng sạc không dây chuẩn Qi và sạc ngược sẽ giúp Galaxy S22 Ultra trở thành chiếc smartphone đa chức năng nổi bật trong phân khúc. Pin hỗ trợ tiết kiệm năng lượng, cho thời lượng sử dụng trong thời gian dài.\n\nĐ&aacute;nh gi&aacute; hiệu năng Galaxy S22 Ultra với Snapdragon 8 Gen 1\n\nĐánh giá hiệu năng Samsung S22 Ultra với Snapdragon 8 Gen 1\n\nSau nhiều năm chạy chip Exynos thì S22 Ultra là mẫu điện thoại Samsung chính hãng hiếm hoi tại Việt Nam chạy Snapdragon 8 Gen 1. Trước khi đánh giá hiệu năng, cùng điểm lại một số thông số cấu hình nhé:\n\n- Vi xử lý: Snapdragon 8 Gen 1\n\n- Bộ nhớ RAM: 8GB hoặc 12GB.\n\n- Bộ nhớ trong: 128GB hoặc 256GB hoặc 512GB.\n\nSau đây là điểm số benchmark được các trang chuyên công nghệ thực hiện.\n\nĐiểm Geekbench 5 của S22 Ultra PCMag thực hiện:\n\n- Điểm đa nhân: 3.433 điểm \n\n- Điểm đơn nhân: 1.232\n\nĐiểm số này có sự khác biệt so với chip Snapdragon 888 được ra mắt nắm 2020. Cụ thể, điểm đơn lõi tăng 13% và đa lõi tăng 9%. Nhưng trên thang điểm chuẩn của GFXBench thì ở một số tác vụ nhất định, con chip này cho hiệu năng tốt hơn khoảng 20%.\n\n Đ&aacute;nh gi&aacute; hiệu năng Galaxy S22 Ultra với Snapdragon 8 Gen 1 - Ảnh 2\n\nHỗ trợ bút S Pen tiện lợi\nTương tự như model tiền nhiệm, điện thoại thông minh Samsung Galaxy S22 Ultra cũng hoàn toàn tương thích với bút cảm ứng S-Pen qua điều khiển không day Air Actions - vốn là điểm đặc trưng của dòng Galaxy Note trước đây. Người dùng có thể dùng S-Pen cho những tác vụ thiết kế, ghi chú nhanh, và điều khiển từ xa với tính hiệu quả vượt trội.\n\nĐộ chính xác bút S-Pen cao, giúp các ghi chú và tin nhắn của bạn trở nên sinh động, thú vị. Chữ viết tay thành văn bản nhanh chóng hoặc thêm hình ảnh động vào, nâng cao tính chuyên nghiệp và sáng tạo.\n\nSamsung đã trang bị khe cắm S Pen trên thiết bị giúp người dùng có thể tiện lợi khi sử dụng. Tuy nhiên khác với trước đó là S Pen sẽ có cùng màu với máy thì năm nay, S-Pen sẽ chỉ có màu đen. \n\nVới bút S Pen, giời đây người dùng Galaxy S22 Ultra có thể thoải mái ghi chú, điều khiển điện thoại như trên các dòng Samsung Note. Bút Spen mới này cũng được cải thiện độ trễ mang lại trải nghiệm dùng chân thực từ viết chữ, vẽ hay ghi chú. \n\nSamsung Galaxy S22 Ultra hỗ trợ b&uacute;t S Pen tiện lợi\n\nKết nối dễ dàng với hệ sinh thái Galaxy\nỞ phiên bản điện thoại Samsung S22 Ultra mới, người dùng có thể kết nối với các thiết bị khác một cách dễ dàng thông qua hệ sinh thái Galaxy như Galaxy S22+, Galaxy Tab S8 Ultra, Galaxy Buds Pro, Galaxy Watch 4,…. Nhờ đó, người dùng có thể truy cập vào các ứng dụng trên điện thoại thông qua máy tính Samsung một cách dễ dàng.\n\nS22 Ultra kết nối dễ d&agrave;ng với hệ sinh th&aacute;i Galaxy\n\nBạn có thể kết nối với Galaxy Tab S8 Ultra, Samsung Notes được đồng bộ hóa cho phép chỉnh sửa. Ngoài ra, việc di chuyển từ màn hình S22 Ultra sang màn hình thiết bị khác thông qua ghép nối giúp người dùng có trải nghiệm màn hình kép.\n\nThêm vào đó là tính năng Smart Switch cho phpeps chuyển đổi dữ liệu qua thiết bị mới nhanh chóng kể cả các thiết bi cũ khác hệ điều hành.\n\nKết nối trực tuyến, bảo mật thông tin cá nhân\nNgười dùng có thể kết nối với nhau trực tuyến thông qua Google Duo, chia sẻ màn hình để xem video cùng nhau giống IRL. Bên cạnh đó, khi khởi động Samsung Knox, dữ liệu cá nhân của bạn sẽ được bảo mật an toàn.\n\nKnox Vault bảo vệ thông tin sinh trắc học, trong khi Thư mục bảo mật khóa dữ liệu riêng tư quan trọng. Trang tổng quan Sử dụng quyền mới cho phép xem ứng dụng đang chia sẻ dữ liệu hoặc đang theo dõi người dùng. Bạn cũng có thể cấp hoặc từ chối quyền truy cập theo điều khoản.\n\nS22 Ultra hỗ trợ kết nối trực tuyến, bảo mật th&ocirc;ng tin c&aacute; nh&acirc;n",
      "shortDesc": "Đúng như các thông tin được đồn đoán trước đó, mẫu flagship mới của gả khổng lồ Hàn Quốc được ra mắt với tên gọi là Samsung Galaxy S22 Ultra với nhiều cải tiến đáng giá. Mẫu điện thoại cao cấp đến từ Samsung này có nhiều thay đổi từ thiết kế, cấu hình cho đến camera. Vậy siêu phẩm này có gì mới, giá bao nhiêu và có nên mua không? Hãy cùng tìm hiểu chi tiết ngay bên dưới nhé!",
      "salientfeatures": "Vi xử lý mạnh mẽ nhất Galaxy - Snapdragon 8 Gen 1 (4 nm)\nCamera mắt thần bóng đêm Nightography - Chụp đêm cực đỉnh\nS Pen đầu tiên trên Galaxy S - Độ trễ thấp, dễ thao tác\nDung lượng pin bất chấp ngày đêm - Viên pin 5000mAh, sạc nhanh 45W",
      "category": "1",
      "isDelete": true,
      "id": 9
    },
    {
      "image": "http://res.cloudinary.com/thisisninh/image/upload/v1659592079/287838556_351757947087542_6391320135667778510_n_kwoudk.jpg",
      "name": "sai rồi",
      "price": "300000",
      "sale": "20000",
      "longDesc": "wrwrere",
      "shortDesc": "ewewerewrd",
      "salientfeatures": "fwsrwrsefsrwf",
      "category": "2",
      "isDelete": true,
      "id": 10
    },
    {
      "id": 11,
      "image": "http://res.cloudinary.com/thisisninh/image/upload/v1659862074/283237630_570024374516363_1197577500313863266_n_vinzbe.jpg",
      "name": "Mai Kha Ninh",
      "price": "500000",
      "sale": "20000",
      "longDesc": "  fsfcrfasecrdxsrfczex dAWSZCEFRXD$ ",
      "shortDesc": "wseflhbujsf ikln/ú drfclujniksdvr cgujiknhdcsgv zrfiklnuj",
      "salientfeatures": "  efcscwszrfdex aszrfc dxvscd xrfv szrfcvdex",
      "category": "3",
      "isDelete": true
    },
    {
      "id": 12,
      "image": "http://res.cloudinary.com/thisisninh/image/upload/v1659947498/290806480_2881116328863522_4182050562083169719_n_da82ta.jpg",
      "name": "Power",
      "price": "300000",
      "sale": "20000",
      "longDesc": " ư4ar4earw4er4resres4res",
      "shortDesc": "fews fesw esfd esesfz c",
      "salientfeatures": " earaewaewrweaaewrzc",
      "category": "3",
      "isDelete": true
    },
    {
      "image": "http://res.cloudinary.com/thisisninh/image/upload/v1660627143/Untitled_wgrta9.jpg",
      "name": "Màn hình đồ hoạ HUAWEI MateView 28",
      "price": "18990000",
      "sale": "18990000",
      "longDesc": "Màn hình sang trọng, tỉ lệ 3:2 độc đáo\nHuawei Mateview sở hữu một thiết kế tối giản với phần khung và chân đế được hoàn thiện từ hợp kim nhôm cao cấp cùng khung viền siêu mỏng mang lại không gian hiển thị lớn hơn. Màn hình đồ họa này với tỉ lệ hiển thị trên thân máy lên tới 94%.\n>>> Xem thêm: Màn hình Huawei Mateview GT thiết kế sáng tạo cùng độ hiển thị vượt trội\n \nMàn hình máy tính Huawei Mateview này có tỉ lệ hiển thị 3:2 nổi bật, khác với tỉ lệ 16:9 tiêu chuẩn trên các dòng màn hình khác hiện có trên thị trường. Tỉ lệ này cho phép màn hình tối ưu hiển thị theo chiều dọc, nhờ đó người dùng có thể xem được nhiều thông tin hơn mà không cần cuộn màn hình.\nHiển thị sắc nét, gàm màu DCI-P3 98%\nMàn hình Huawei Mateview được trang bị độ phân giải cao mang lại khả năng hiển thị sắc nét. Màn hình với mật độ điểm ảnh cao cùng gam màu DCI-P3 98% mang lại dải màu rộng, đáp ứng tốt các nhu cầu chỉnh sửa với dài màu chân thực và chính xác tới ∆E<2.\n \nNgoài tam với chứng nhận Display HDR 400, màn hình HUAWEI MateView giúp tối ưu hóa màu sắc. Cùng với đó là độ sáng tối đa lên đến 500 nits giúp hiển thị rõ ràng đến từng chi tiết.\nMàn hình Huawei Mateview còn được trang bị tính năng bảo vật mắt TUV Rheinland giúp đôi mắt người dùng khỏe hơn.\nKết nối không dây tiện lợi, thanh tác vụ thông minh\n \nMàn hình Huawei Mateview sở hữu một kết nối không dây thông minh, Với thanh tác vụ Smart Bar, người dùng có thể chuyển đổi nhanh chóng từ màn hình trình chiếu sang máy tính xác tay, điện thoại hoặc ngược lại. Lưu ý, kết nối chỉ khả dụng trên model phiên bản không dây ( HSN – CBA)\nMua màn hình Huawei Mateview giá rẻ tại CellphoneS\nMàn hình Huawei Mateview chính hãng với kích thước lớn, độ chính xác cao sẽ là một màn hình chuyên dùng cho dân đồ họa chuyên nghiệp. nếu bạn đang tìm một mẫu màn hình như vậy cho công việc, đến ngay CellphoneS để mua ngay với giá ưu đãi cùng nhiều khuyến mãi hấp dẫn.\n",
      "shortDesc": "Công việc đồ họa đòi hỏi các yêu cầu cao về màn hình, đặc biệt là màu sắc. Màn hình Huawei Mateview được Huawei thiết kế dành riêng vời nhiều công nghệ màn hình và màu sắc, thích hợp với công việc đồ họa chuyên nghiệp.",
      "salientfeatures": "•\tMàn Hình 4K+ Trung Thực trải nghiệm hình ảnh sống động, sắc nét\n•\tHUAWEI Smart Bar điều khiển cảm ứng trực quan, dễ dàng tương tác\n•\tKết nối liền mạch giữa các thiết bị, trình chiếu không dây nâng tầm hiệu quả\n•\tThiết kế thanh lịch, tối giản hoà hợp với mọi không gian làm việc.\n",
      "category": "4",
      "isDelete": false,
      "id": 13
    }
  ],
  "category": [
    {
      "name": "Diện thoại",
      "id": "1"
    },
    {
      "name": "Máy tính bảng",
      "id": "2"
    },
    {
      "name": "Laptop",
      "id": "3"
    },
    {
      "name": "Phụ kiện",
      "id": "4"
    }
  ]
}